app/views/comments/_comment.html.erb

INSERT INTO `comments` (`content`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('kakakkakaa', 101, 302, '2018-06-29 10:22:04', '2018-06-29 10:22:04')
---
      <% if current_user?(comment.user) %>
        <%= link_to 'Reply', new_comment_path(comment.id) %> .
        <a class="edit-comment"> Edit </a> .
        <%= link_to 'Delete', comment_path(comment), method: :delete,
        data: { confirm: 'Are you sure?' }, remote: true %> .
        <%= time_ago_in_words(comment.created_at) %> ago.
      <% end %>