app/views/posts/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 295
---
<script>
  $(document).ready(function() {
    $('#comment_form form').hide()
    $('.edit-comment').click(function() {
      $(this).closest('.comment').find('.show-comment').hide()
      $(this).closest('.comment').find('form').show()
    });
  });