app/controllers/comments_controller.rb

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 15 LIMIT 1
---
  def edit
    @comment = Comment.find(params[:id])

INSERT INTO `comments` (`content`, `user_id`, `micropost_id`, `created_at`, `updated_at`) VALUES ('lala', 101, 303, '2018-06-27 13:43:02', '2018-06-27 13:43:02')
---
  def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
      if @comment.save

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
  	@comment = Comment.find(params[:id])
  	post = @comment.post
    @comment.destroy

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
UPDATE `comments` SET `content` = 'kkkk... hello world~~~\nyt6y', `updated_at` = '2018-06-29 13:25:02' WHERE `comments`.`id` = 2
---
  def update
    @comment = Comment.find(params[:id])
    respond_to do |format|
      if @comment.update_attributes(comment_params)