app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'thotranuet97@gmail.com' LIMIT 1

  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE `users` SET `password_digest` = '$2a$10$zaCp4gTbAFKLa9U8T2j1VePXCI4e22DfEwHMKt7SmeALrmyjD6INW', `updated_at` = '2018-06-20 13:09:48' WHERE `users`.`id` = 102