app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO `posts` (`title`, `content`, `picture`, `user_id`, `created_at`, `updated_at`) VALUES ('ahihi', 'haha', 'Screenshot_from_2018-06-05_16-38-33.png', 101, '2018-06-29 04:42:12', '2018-06-29 04:42:12')

  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.all
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 289 ORDER BY `posts`.`created_at` DESC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 295