app/controllers/users_controller.rb

  def index
  	@users = User.paginate(page: params[:page], per_page: 10)
---
SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`

  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 ORDER BY `posts`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `posts` WHERE `posts`.`user_id` = 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('Tho Tran', 'thotranuet97@gmail.com', '2018-06-20 12:12:39', '2018-06-20 12:12:39', '$2a$10$NUv331hUu2hpqoHNI03DDeq235Qc24KeqHdkqJipCdvuQlhvuDlnm', '$2a$10$.efTyEE0kb8drVDcFQnAWeytguHA.ELouAo2dq988WtGG5vKMw0by')

  def following
    @title = "Following"
    @user  = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def followers
    @title = "Followers"
    @user  = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1